//=============================================================================
//
// [scene2D.h]
// Author : shota fukuoka
//
//=============================================================================
#ifndef _SKYBOX_H_
#define _SKYBOX_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include "../mesh.h"

//*****************************************************************************
// ライブラリファイル
// [構成プロパティ]->[リンカー]->[入力]->[追加の依存ファイル]に記述しても可能
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************
class CPlayer;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class SkyBox : public Mesh
{
public:
	SkyBox(RenderManager* pRenderManager,
		ShaderManager* pShaderManager,
		TextureManager* pTextureManager,
		AppRenderer::Constant* pConstant);			//コンストラクタ

	virtual ~SkyBox();			//デストラクタ

	void Release(void);	//終了処理

	void Update(void);	//更新処理
	
	void MakeVertex(void);

private:
	VECTOR3				m_pos;
	ID3D11Buffer* m_pVertexBuffer;
	VECTOR3				m_size;
};

#endif