//=============================================================================
//
// mesh_manager.h
// Author : shoto fukuoka
//
//=============================================================================
#ifndef _MESH_MANAGER_H_
#define _MESH_MANAGER_H_

//*****************************************************************************
// ヘッダファイル
//*****************************************************************************
#include <list>
#include "mesh.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class MeshManager
{
	std::list<Mesh*>		m_list;
public:

	//コンストラクタ
	MeshManager();

	//デストラクタ
	virtual ~MeshManager();

	//追加
	void AddMesh(Mesh* mesh);

	//削除
	void DeleteMesh(const Mesh* mesh);

	//全更新
	void UpdateAll(void);

	//全消去
	void ReleaseAll(void);
};

#endif
