//=============================================================================
//
// object.h
// Author : SHOTA FUKUOKA
//
//=============================================================================
#ifndef _OBJECT_H_
#define _OBJECT_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <Windows.h>
#include "../lib/vector.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class Object
{
public:
	//transform
	struct Transform
	{
		VECTOR3	position;
		VECTOR3 rot;
		VECTOR3 scale;
	};

	//コンストラクタ
	Object();

	//デストラクタ
	virtual ~Object();

	//初期化
	virtual HRESULT Init(void);

	//終了
	virtual void Release(void);

	//更新
	virtual void Update(void);

protected:
	Transform*				m_pTransform;
};

#endif